from docxtpl import DocxTemplate

doc = DocxTemplate("t-13-template v3.docx")
context = { 
    'project' : "ICT-MT: Программная платформа полного цикла конфигурирования ИЭУ",
    'rep_date' : "31.01.2025",
    'rep_period' : "12 месяц 2025 год",
    'hod_name' : "И.И. Иванов",
    'hod_position' : "Начальник",
    'hod_sign' : "",
    'curr_day' : "13",
    'curr_month' : "марта",
    'curr_year' : "2025",
    'emp_contents': [
        {'ord': '1', 'name':'Иванов Иван Иванович', 'position':'Инженер', 'tabnum':'111111', 'pres1':'Я', 'h1':'8,00', 'pres2':'Я', 'h2':'8,00', 'pres3':'Я', 'h3':'8,00', 'pres4':'Я', 'h4':'8,00', 'pres5':'Я', 'h5':'8,00', 'pres6':'Я', 'h6':'8,00', 'pres7':'Я', 'h7':'8,00', 'pres8':'Я', 'h8':'8,00', 'pres9':'Я', 'h9':'8,00', 'pres10':'Я', 'h10':'8,00', 'pres11':'Я', 'h11':'8,00', 'pres12':'Я', 'h12':'8,00', 'pres13':'Я', 'h13':'8,00', 'pres14':'Я', 'h14':'8,00', 'pres15':'Я', 'h15':'8,00', 'pres16':'Я', 'h16':'8,00', 'pres17':'Я', 'h17':'8,00', 'pres18':'Я', 'h18':'8,00', 'pres19':'Я', 'h19':'8,00', 'pres20':'Я', 'h20':'8,00', 'pres21':'Я', 'h21':'8,00', 'pres22':'Я', 'h22':'8,00', 'pres23':'Я', 'h23':'8,00', 'pres24':'Я', 'h24':'8,00', 'pres25':'Я', 'h25':'8,00', 'pres26':'Я', 'h26':'8,00', 'pres27':'Я', 'h27':'8,00', 'pres28':'Я', 'h28':'8,00', 'pres29':'Я', 'h29':'8,00', 'pres30':'Я', 'h30':'8,00', 'pres31':'Я', 'h31':'8,00', 'tot_d':'31', 'tot_h':'248', 'half_d':'15','half_h':'120'},
        {'ord': '2', 'name':'Петров Петр Петрович', 'position':'Ведущий инженер конструктор', 'tabnum':'222222', 'pres1':'Я', 'h1':'8,00', 'pres2':'Я', 'h2':'8,00', 'pres3':'Я', 'h3':'8,00', 'pres4':'Я', 'h4':'8,00', 'pres5':'Я', 'h5':'8,00', 'pres6':'Я', 'h6':'8,00', 'pres7':'Я', 'h7':'8,00', 'pres8':'Я', 'h8':'8,00', 'pres9':'Я', 'h9':'8,00', 'pres10':'Я', 'h10':'8,00', 'pres11':'Я', 'h11':'8,00', 'pres12':'Я', 'h12':'8,00', 'pres13':'Я', 'h13':'8,00', 'pres14':'Я', 'h14':'8,00', 'pres15':'Я', 'h15':'8,00', 'pres16':'Я', 'h16':'8,00', 'pres17':'Я', 'h17':'8,00', 'pres18':'Я', 'h18':'8,00', 'pres19':'Я', 'h19':'8,00', 'pres20':'Я', 'h20':'8,00', 'pres21':'Я', 'h21':'8,00', 'pres22':'Я', 'h22':'8,00', 'pres23':'Я', 'h23':'8,00', 'pres24':'Я', 'h24':'8,00', 'pres25':'Я', 'h25':'8,00', 'pres26':'Я', 'h26':'8,00', 'pres27':'Я', 'h27':'8,00', 'pres28':'Я', 'h28':'8,00', 'pres29':'Я', 'h29':'8,00', 'pres30':'Я', 'h30':'8,00', 'pres31':'Я', 'h31':'8,00','tot_d':'31', 'tot_h':'248', 'half_d':'15','half_h':'120'},
    ]
      }
doc.render(context)
doc.save("generated_doc.docx")